tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

brew "mas"

mas "Xcode", id: 497799835

mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Final Cut Pro", id: 424389933
mas "Motion", id: 434290957

mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161

mas "1Password", id: 1333542190
mas "Things 3", id: 904280696
mas "iA Writer", id: 928871589

mas "GIPHY Capture", id: 668208984
mas "Pixel Winch", id: 735066709
mas "Unclutter", id: 577085396
mas "Noizio", id: 928871589
mas "Divvy", id: 413857545

cask "sketch"
cask "fantastical"
cask "alfred"
cask "google-chrome"
cask "handbrake"
cask "iina"
cask "imageoptim"
cask "keepingyouawake"
cask "visual-studio-code"

brew "clamav"
brew "mysql", restart_service: true
brew "openssl"
brew "pcre2"
brew "rbenv"
brew "zlib"

brew "youtube-dl"
brew "node"

brew "font-ia-writer-mono"
brew "font-ia-writer-duo"
brew "font-ia-writer-quattro"

brew "font-open-sans"
brew "font-poppins"
brew "font-roboto"
brew "font-fira-sans"
brew "font-karla"

brew "font-source-code-pro"
brew "font-source-sans-pro"
brew "font-source-serif-pro"

brew "font-playfair-display"
brew "font-merriweather"
brew "font-lora"
brew "font-crimson-text"
brew "font-abril-fatface"

brew "font-orbitron"
