tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "mas"

mas "Xcode", id: 497799835

mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Final Cut Pro", id: 424389933
mas "Motion", id: 434290957

mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905

mas "1Password", id: 1333542190
mas "Things", id: 904280696
mas "iA Writer", id: 928871589
mas "Tot", id: 1491071483
mas "Table Tool", id: 1122008420
mas "FocusList", id: 1086877679

mas "GIPHY Capture", id: 668208984
mas "Pixel Winch", id: 735066709
mas "Unclutter", id: 577085396
mas "Noizio", id: 928871589
mas "Entity Pro", id: 1503988785
mas "The Unarchiver", id: 425424353
mas "Soulver", id: 413965349

# Two options for window management; rectangle is open source.
# mas "Divvy", id: 413857545
cask "rectangle"

cask "sketch"
cask "sublime-text"
cask "sublime-merge"
cask "visual-studio-code"
cask "google-chrome"
cask "imageoptim"

cask "post-haste"
cask "cleanshot"
cask "cleanmymac"
cask "daisydisk"
cask "pictogram"

cask "fantastical"
cask "alfred"
cask "textexpander5"

cask "screenflick"
cask "recut"
cask "flotato"
cask "handbrake"
cask "iina"
cask "beamer"
cask "keepingyouawake"
cask "boop"

cask "adoptopenjdk8"
brew "fnm"
brew "json-c"
brew "clamav"
brew "openssl"
brew "pcre2"
brew "rbenv"
brew "zlib"
brew "libsodium"
brew "qt"

brew "mysql", restart_service: true
brew "elasticsearch", restart_service: true
brew "rabbitmq", restart_service: true
brew "redis", restart_service: true

brew "youtube-dl"
brew "node"

cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"

cask "font-open-sans"
cask "font-poppins"
cask "font-roboto"
cask "font-fira-sans"
cask "font-karla"
cask "font-oswald"

cask "font-league-spartan"
cask "font-league-gothic"

cask "font-libre-baskerville"
cask "font-libre-franklin"
cask "font-libre-caslon-display"
cask "font-libre-caslon-text"

cask "font-office-code-pro"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

cask "font-playfair-display"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-lora"
cask "font-crimson-text"
cask "font-abril-fatface"

cask "font-orbitron"

cask "font-space-grotesk"
cask "font-space-mono"

cask "font-pt-sans"
cask "font-pt-serif"
cask "font-pt-mono"
