tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "mas"

# macOS office suite alternative
mas "Xcode", id: 497799835
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694

# Video editing and motion graphics
mas "Final Cut Pro", id: 424389933
mas "Motion", id: 434290957

# Visual design tools
mas "Pixelmator Pro", id: 1289583905
mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161
cask "affinity-publisher"
cask "sketch"
cask "figma"

# Favourite pixel-peeping tool
mas "Pixel Winch", id: 735066709

# Inspect a wide range of typographic symbols
mas "Entity Pro", id: 1503988785

# Password manager
mas "1Password", id: 1333542190

# Favourite todo app
mas "Things", id: 904280696

# Favourite writing app
mas "iA Writer", id: 928871589

# Open more archive formats
mas "The Unarchiver", id: 425424353

# Spotlight replacement for 2022
cask "raycast"

# Calendar replacement for 2022
cask "cron"

# Project management
cask "linear"

# Communication
cask "slack"
cask "basecamp"
cask "zoom"

# Open source macOS window snapping utility
cask "rectangle"

# Reverse scrolling per-device in macOS; allows for “natural” scroll direction on trackpads,
# and regular scrolling on mouse wheels.
cask "scroll-reverser"

# Developer tools
brew "neovim"
cask "sublime-text"
cask "sublime-merge"
cask "google-chrome"
cask "imageoptim"

# Better macOS screenshots
cask "cleanshot"

# Webpage screenshot utility
cask "paparazzi"

# Disk space visualisation
cask "daisydisk"

# Text shortcuts and macros
cask "textexpander5"

# High quality screen recording
cask "screenflick"

# Automatically trim silence in videos
cask "recut"

# Create individual macos apps from 
cask "flotato"

# Graphical interface for video transcoding
cask "handbrake"

# Open source media player with broad compatibility. Like VLC but nice.
cask "iina"

# AirPlay more formats to Apple TV
cask "beamer"

# Developer tools
cask "boop"

# Node and Ruby version managers
brew "fnm"
brew "rbenv"
brew "openssl"
brew "node"
brew "ffmpeg"
brew "yt-dlp"

# Fonts
cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"

cask "font-open-sans"
cask "font-roboto"
cask "font-fira-sans"
cask "font-karla"
cask "font-oswald"

cask "font-league-spartan"
cask "font-league-gothic"

cask "font-libre-baskerville"
cask "font-libre-franklin"
cask "font-libre-caslon-display"
cask "font-libre-caslon-text"

cask "font-office-code-pro"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

cask "font-playfair-display"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-lora"
cask "font-crimson-text"
cask "font-abril-fatface"

cask "font-orbitron"

cask "font-space-grotesk"
cask "font-space-mono"

cask "font-pt-sans"
cask "font-pt-serif"
cask "font-pt-mono"
